import 'package:flutter/material.dart';

void main() {
  runApp(MyApp());
}

class MyApp extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return MaterialApp(
      title: 'ภาษาอังกฤษบทที่2 มัธยมปลาย',
      theme: ThemeData(
        primarySwatch: Colors.blue,
        visualDensity: VisualDensity.adaptivePlatformDensity,
      ),
      home: Eng02(),
    );
  }
}

class Eng02 extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('ภาษาอังกฤษ บทที่2 มัธยมปลาย'),
      ),
      body: SingleChildScrollView(
        child: Center(
          child: Padding(
            padding: const EdgeInsets.all(20.0),
            child: Column(
              crossAxisAlignment: CrossAxisAlignment.start,
              children: [
                Text(
                  'คำนาม(Nouns)\n\n'
                  'คำนามคือคำที่ใช้แทนคน สถานที่ สิ่งของ หรือความคิด ในโลกที่รอบข้างเรา พวกเรามักใช้คำนามเพื่อเรียกชื่อวัตถุ สิ่งมีชีวิต หรือความคิดต่าง ๆ นี้ นี่คือบางความสำคัญเกี่ยวกับคำนาม\n\n'
                  '1. ประเภทของคำนาม:\n\n'
                  '   1.1 คำนามทั่วไป (Common Nouns): เป็นชื่อทั่วไปที่ไม่ใช่บุคคลหรือสถานที่เฉพาะ ๆ เช่น "หนังสือ," "เมือง," และ "หมา."\n\n'
                  '   1.2 คำนามเฉพาะ (Proper Nouns): เป็นชื่อเฉพาะที่ระบุบุคคล สถานที่หรือสิ่งของ และขึ้นต้นด้วยตัวอักษรใหญ่ เช่น "จอห์น," "ปารีส," และ "โคโค่-โคล่า."\n\n'
                  '   1.3 คำนามสมอารมณ์ (Concrete Nouns): เป็นวัตถุที่สามารถสัมผัสหรือรับรู้ได้ด้วยการใช้ประสาทตา และอุปกรณ์ต่าง ๆ เช่น "โต๊ะ," "แอปเปิ้ล," และ "รถ."\n\n'
                  '   1.4 คำนามนาม (Abstract Nouns): เป็นความคิด ความรู้สึก หรือคุณลักษณะที่ไม่สามารถมองเห็นหรือสัมผัสได้ อย่างเช่น "ความรัก," "เสรีภาพ," และ "ความสุข."\n\n'
                  '2. การใช้งานของคำนาม:\n\n'
                  '   2.1 กรรม: คำนามที่ทำหน้าที่เป็นผู้ปฏิบัติการในประโยค\n\n'
                  '   2.2 กริยา: คำนามที่รับผลกระทำจากกริยาในประโยค\n\n'
                  '   2.3 ตามเสียง: คำนามที่ใช้เป็นคำบอกเล่า\n\n'
                  'สรรพนาม (Pronouns)\n\n'
                  'สรรพนามคือคำที่ใช้แทนคำนามเพื่อหลีกเลี่ยงคำซ้ำ หรืออ้างอิงกลับไปยังคำนามที่กล่าวมาก่อนหน้านั้น เพื่อช่วยลดความซ้ำซ้อนและเพิ่มความคล่องตัวให้กับภาษา นี่คือบางความสำคัญเกี่ยวกับสรรพนาม\n\n'
                  '1. ประเภทของสรรพนาม:\n\n'
                  '   1.1 สรรพนามบุคคล (Personal Pronouns): ใช้อ้างอิงตัวบุคคลหรือสิ่งของเฉพาะ เช่น "ฉัน," "คุณ," "เขา," "เธอ," "มัน," "เรา," และ "พวกเขา."\n\n'
                  '   1.2 สรรพนามเจ้าของ (Possessive Pronouns): แสดงความเป็นเจ้าของหรือครอบครอง เช่น "ของฉัน," "ของคุณ," "ของเขา," "ของเธอ," "ของเรา," และ "ของพวกเขา."\n\n'
                  '   1.3 สรรพนามชี้ (Demonstrative Pronouns): ใช้ชี้แสดงสิ่งของเฉพาะ เช่น "นี้," "นั้น," "เหล่านี้," และ "เหล่านั้น."\n\n'
                  '   1.4 สรรพนามเกี่ยวข้อง (Relative Pronouns): ใช้เริ่มต้นเปิดตัวประโยคซึ่งเรียกว่า relative clauses เช่น "ผู้ใด," "ซึ่ง," "ของผู้ใด," "ซึ่งของ" และ "ที่."\n\n'
                  '   1.5 สรรพนามแสดงคำถาม (Interrogative Pronouns): ใช้เมื่อต้องการถามคำถาม เช่น "ใคร," "ใคร," "ของใคร," "ซึ่ง," และ "อะไร."\n\n'
                  '   1.6 สรรพนามไม่จำกัด (Indefinite Pronouns): ใช้อ้างอิงถึงบุคคลหรือสิ่งของที่ไม่ระบุเฉพาะ เช่น "ทุกคน," "บางคน," "ใครบางคน," "ไม่มีใคร," และ "ทุกสิ่ง."\n\n'
                  '2. การใช้งานของสรรพนาม:\n\n'
                  '   2.1 สรรพนามบุคคล: ใช้เป็นเป็นกร subject ในประโยค\n\n'
                  '   2.2 สรรพนามเจ้าของ: ใช้เป็น object ของกริยาหรือคำบอกเล่าในประโยค\n\n'
                  '   2.3 สรรพนามแสดงความเป็นเจ้าของ: แสดงความเป็นเจ้าของหรือครอบครองโดยไม่ต้องใช้คำนาม\n\n'
                  'การเข้าใจและการใช้คำนามและสรรพนามเป็นสิ่งสำคัญสำหรับการสร้างประโยคที่ชัดเจนและกระชับในภาษาอังกฤษ พวกเขาช่วยให้สื่อสารได้อย่างมีประสิทธิภาพขึ้น พร้อมลดความซ้ำซ้อนและเพิ่มความคล่องตัวให้กับภาษาด้วย\n\n',
                  style: TextStyle(
                    fontSize: 15,
                    fontWeight: FontWeight.bold,
                  ),
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}
