import 'package:flutter/material.dart';

void main() {
  runApp(MyApp());
}

class MyApp extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return MaterialApp(
      title: 'คณิตศาสตร์บทที่1 มัธยมปลาย',
      theme: ThemeData(
        primarySwatch: Colors.blue,
        visualDensity: VisualDensity.adaptivePlatformDensity,
      ),
      home: Math01(),
    );
  }
}

class Math01 extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('คณิตศาสตร์ บทที่1 มัธยมปลาย'),
      ),
      body: SingleChildScrollView(
        child: Center(
          child: Padding(
            padding: const EdgeInsets.all(20.0),
            child: Column(
              crossAxisAlignment: CrossAxisAlignment.start,
              children: [
                Text(
                  'เซตในคณิตศาสตร์เป็นกลุ่มของวัตถุหรือสมาชิกที่มีลักษณะเฉพาะบางอย่าง เช่น จำนวนเต็ม, จำนวนจริง, ตัวอักษร หรือวัตถุอื่นๆ ซึ่งเราสามารถรวบรวมเป็นกลุ่มเซตได้ตามเงื่อนไขที่กำหนดไว้\n\n'
                  'เราสามารถแสดงเซตโดยใช้เครื่องหมายวงเล็บปีกกา "{}" และระบุสมาชิกของเซตด้วยเครื่องหมายจุด "•" หรือใช้วิธีการเขียนแบบระบุสมาชิกเซต ซึ่งเป็นการเขียนสมาชิกของเซตออกมาทั้งหมด\n\n'
                  'ตัวอย่างเช่น:\n\n'
                  'เซตของจำนวนเต็มบวกน้อยกว่าหรือเท่ากับ 5 สามารถเขียนได้เป็น {1, 2, 3, 4, 5}\n'
                  'เซตของตัวเลขคู่สามารถเขียนได้เป็น {2, 4, 6, 8, ...}\n'
                  'เซตของสมาชิกที่เป็นตัวอักษรในคำว่า "apple" สามารถเขียนได้เป็น {a, p, l, e}\n\n'
                  'นอกจากนี้เรายังสามารถระบุเซตที่ไม่มีสมาชิกเลยได้ โดยใช้เครื่องหมายวงเล็บปีกกาและไม่ระบุสมาชิก เช่น {} หรือ ∅ คือเซตว่าง\n\n'
                  'การทำงานกับเซตในคณิตศาสตร์มีหลายประเภท เช่น การสมบูรณ์เซต (Union), การตัดเซต (Intersection), การแยกส่วน (Difference) และการจำแนกเซต (Complement) เป็นต้น ซึ่งทำให้สามารถใช้เซตในการแก้ปัญหาทางคณิตศาสตร์และวิทยาศาสตร์ได้อย่างมีประสิทธิภาพ สมาชิก (Elements): เซตประกอบด้วยสมาชิกหรือวัตถุที่เรากำหนดไว้ภายในเซตนั้นๆ สมาชิกสามารถเป็นอะไรก็ได้ เช่น ตัวเลข, ตัวอักษร, หรือเซตอื่นๆ\n\n'
                  'การระบุเซต (Specifying a Set): เราสามารถระบุเซตได้หลายวิธี แต่วิธีที่พอเข้าใจและใช้กันมากที่สุดคือการใช้เครื่องหมายวงเล็บปีกกา "{ }" และระบุสมาชิกที่อยู่ในเซตนั้นๆ ตามด้วยเครื่องหมายจุด "•" เช่น {1, 2, 3, 4} แสดงถึงเซตของจำนวนเต็มจำนวน 1, 2, 3, และ 4\n\n'
                  'การแสดงเซต (Set Notation): เราสามารถใช้สัญลักษณ์และสัญลักษณ์พิเศษเพื่อแสดงเซตและความสัมพันธ์ระหว่างเซต เช่น "∈" หมายถึง "เป็นสมาชิกของ", "∪" หมายถึง "สมมติ", "∩" หมายถึง "ตัดกัน" และ "∅" หมายถึง "เซตว่าง"\n\n'
                  'ประเภทของเซต (Types of Sets): มีหลายประเภทของเซต เช่น\n\n'
                  'เซตย่อย (Subset): เซตที่มีสมาชิกทั้งหมดอยู่ในเซตอื่น เช่น {1, 2} เป็นเซตย่อยของ {1, 2, 3, 4}\n'
                  'เซตสมบูรณ์ (Universal Set): เซตที่รวมเซตทั้งหมดที่เรากำหนด เช่น จำนวนเต็มทั้งหมดหรือจำนวนจริงทั้งหมด\n'
                  'เซตเดียวกัน (Equal Sets): เซตที่มีสมาชิกเหมือนกัน\n'
                  'เซตว่าง (Empty Set): เซตที่ไม่มีสมาชิกเลย เช่น {}\n'
                  'เซตไจ้กัน (Disjoint Sets): เซตที่ไม่มีสมาชิกร่วมกันเลย\n\n'
                  'การดำเนินการกับเซต (Operations on Sets): มีหลายการดำเนินการที่เราสามารถทำกับเซตได้ เช่น\n\n'
                  'สมาชิกทั้งหมด (Union): การรวมสมาชิกทั้งหมดของเซตทั้งสองเข้าด้วยกัน\n'
                  'สมาชิกที่ซ้ำกัน (Intersection): การเลือกเฉพาะสมาชิกที่มีอยู่ในทั้งสองเซต\n'
                  'สมาชิกที่ไม่ซ้ำกัน (Difference): การเลือกสมาชิกที่มีอยู่ในเซตหนึ่งแต่ไม่มีในเซตอีกตัวหนึ่ง\n'
                  'เซตผลลัพธ์ (Complement): สมาชิกที่ไม่อยู่ในเซตที่กำหนด',
                  style: TextStyle(
                    fontSize: 15,
                    fontWeight: FontWeight.bold,
                  ),
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}
