import 'package:flutter/material.dart';

void main() {
  runApp(MyApp());
}

class MyApp extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return MaterialApp(
      title: 'คณิตศาสตร์บทที่2 มัธยมปลาย',
      theme: ThemeData(
        primarySwatch: Colors.blue,
        visualDensity: VisualDensity.adaptivePlatformDensity,
      ),
      home: Math02(),
    );
  }
}

class Math02 extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('คณิตศาสตร์ บทที่2 มัธยมปลาย'),
      ),
      body: SingleChildScrollView(
        child: Center(
          child: Padding(
            padding: const EdgeInsets.all(20.0),
            child: Column(
              crossAxisAlignment: CrossAxisAlignment.start,
              children: [
                Text(
                  'ตรรกศาสตร์เป็นสาขาหนึ่งของคณิตศาสตร์ที่เกี่ยวกับการใช้ตรรกะหรือการวิเคราะห์ว่าประพจน์ต่างๆ เป็นจริงหรือเท็จ โดยใช้หลักการและกฎของตรรกศาสตร์ในการตรวจสอบความเป็นจริงของประพจน์เหล่านั้น ซึ่งเป็นพื้นฐานที่สำคัญในการวิเคราะห์และการอ้างอิงข้อมูลในหลายด้านของวิชาวิทยาศาสตร์และการแก้ปัญหาในชีวิตประจำวันด้วยวิธีตรรกะ\n\n'
                  'ในระดับมัธยมศึกษาชั้นมัธยมศึกษาปีที่ 4 หรือระดับม.4 การเรียนรู้เกี่ยวกับตรรกศาสตร์จะมุ่งเน้นไปที่หลักการและกฎของตรรกศาสตร์ที่เกี่ยวกับการใช้ตรรกะในการวิเคราะห์และการเหตุผล ซึ่งรวมถึงเรื่องการตรวจสอบประพจน์ การใช้การตรรกะในการเปรียบเทียบ การเขียนและการอ่านบทพิสูจน์ และการนำเสนอข้อมูลตามหลักการตรรกะ\n\n'
                  '1. ประพจน์ (Propositions): ประพจน์เป็นประโยคที่มีความหมายเพื่อให้เราสามารถระบุว่าเป็นจริงหรือเท็จ เช่น "วันนี้คือวันจันทร์" หรือ "2 เท่ากับ 3"\n\n'
                  '2. การสร้างประพจน์ (Constructing Propositions): เรียนรู้เกี่ยวกับการสร้างประพจน์ต่างๆ โดยใช้คำนาม คำกริยา หรือคำวิเศษ เพื่อให้ได้ประพจน์ที่ชัดเจน\n\n'
                  '3. การนำเสนอประพจน์ (Presenting Propositions): เรียนรู้เกี่ยวกับการเขียนและการอ่านประพจน์ที่เข้าใจง่ายและชัดเจน\n\n'
                  '4. การแสดงประพจน์ (Expressing Propositions): เรียนรู้เกี่ยวกับการใช้สัญลักษณ์ต่างๆ เพื่อแสดงประพจน์ ซึ่งเป็นวิธีที่ชั้นความหมายและทำให้ง่ายต่อการวิเคราะห์\n\n'
                  '5. การเปรียบเทียบประพจน์ (Comparing Propositions): เรียนรู้เกี่ยวกับการใช้การตรรกะในการเปรียบเทียบประพจน์เพื่อหาความเป็นจริงของประพจน์\n\n'
                  '6. การตรวจสอบประพจน์ (Testing Propositions): เรียนรู้เกี่ยวกับวิธีการใช้การตรรกะในการตรวจสอบความเป็นจริงของประพจน์\n\n'
                  '7. การพิสูจน์ (Proofs): เรียนรู้เกี่ยวกับการสร้างและการอ่านบทพิสูจน์เพื่อแสดงความเป็นจริงของประพจน์\n\n'
                  'ในตรรกศาสตร์ เรามักจะใช้สัญลักษณ์เพื่อแทนประพจน์ เช่น ใช้ตัวอักษรเล็กๆ เช่น p, q, r เป็นต้น และใช้เครื่องหมายตรรกะ เช่น ∧ (และ), ∨ (หรือ), ¬ (ไม่), → (ถ้า...แล้ว), ↔ (ก็ต่อเมื่อ) เป็นต้น เพื่อทำการเชื่อมต่อหรือการวิเคราะห์ประพจน์ในระดับสูงขึ้น\n\n',
                  style: TextStyle(
                    fontSize: 15,
                    fontWeight: FontWeight.bold,
                  ),
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}
