import 'package:flutter/material.dart';

void main() {
  runApp(MyApp());
}

class MyApp extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return MaterialApp(
      title: 'วิทยาศาสตร์บทที่1 มัธยมปลาย',
      theme: ThemeData(
        primarySwatch: Colors.blue,
        visualDensity: VisualDensity.adaptivePlatformDensity,
      ),
      home: Sci01(),
    );
  }
}

class Sci01 extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('วิทยาศาสตร์ บทที่1 มัธยมปลาย'),
      ),
      body: SingleChildScrollView(
        child: Center(
          child: Padding(
            padding: const EdgeInsets.all(20.0),
            child: Column(
              crossAxisAlignment: CrossAxisAlignment.start,
              children: [
                Text(
                  'บทเรียนเกี่ยวกับ "การเคลื่อนที่" ในวิชาฟิสิกส์ชั้นมัธยมปีที่ 4 เป็นเนื้อหาที่สำคัญที่เป็นพื้นฐานสำหรับการเรียนรู้เกี่ยวกับพลศาสตร์และการเคลื่อนที่ของวัตถุต่างๆ ซึ่งมีหลายประเภท แต่ในบทนี้จะเน้นไปที่พลศาสตร์ของวัตถุที่เคลื่อนที่ในเส้นตรง โดยมีหลักการพื้นฐานดังนี้:\n\n'
                  '1. การเคลื่อนที่และตำแหน่ง: เคลื่อนที่คือการเปลี่ยนตำแหน่งของวัตถุตามเวลา แบ่งออกเป็นเคลื่อนที่ในเส้นตรงและเคลื่อนที่โค้ง (หรือหมุน) ในบทนี้ เราจะสนใจเฉพาะเคลื่อนที่ในเส้นตรง\n\n'
                  '2. ความเร็ว: ความเร็วคืออัตราการเปลี่ยนแปลงของตำแหน่งต่อหนึ่งหน่วยเวลา เราสามารถหาความเร็วเฉลี่ยและความเร็วสูงสุดของวัตถุได้\n\n'
                  '3. เวลา: เวลาเป็นปัจจัยสำคัญในการวัดการเคลื่อนที่ โดยมักจะใช้หน่วยเวลาเป็นวินาที (s)\n\n'
                  '4. การเคลื่อนที่แบบเส้นตรงและแรง: การเคลื่อนที่แบบเส้นตรงสามารถอธิบายได้ด้วยกฎของ Newton ซึ่งกล่าวไว้ว่า "วัตถุที่อยู่ในสภาวะนิ่งจะยังคงอยู่ในสภาวะนิ่ง และวัตถุที่เคลื่อนที่จะยังคงเคลื่อนที่ในเส้นตรงด้วยความเร็วคงที่ถ้าไม่มีแรงที่กระทำอยู่"\n\n'
                  '5. การเคลื่อนที่แบบเส้นตรงและค่าเร็วต่างๆ: สามารถใช้สมการทางคณิตศาสตร์ในการหาค่าต่างๆ เช่น ระยะทางที่เคลื่อนที่ได้, เวลาที่ใช้ในการเคลื่อนที่, หรือความเร็วเฉลี่ย\n\n'
                  '6. การกระทำของแรง: แรงเป็นสิ่งที่กระทำกับวัตถุเพื่อเปลี่ยนแปลงสถานะการเคลื่อนที่ของมัน มีหลายประเภทของแรง เช่น แรงแรงเสียดทาน, แรงแลดู, แรงนิ่ง, แรงแม่เหล็ก, แรงน้ำย้อย, และอื่นๆ\n\n'
                  'การเรียนรู้เรื่องการเคลื่อนที่ในวิทยาศาสตร์ชั้นมัธยม 4 จะช่วยให้เข้าใจหลักการพื้นฐานเกี่ยวกับการเคลื่อนที่และการกระทำของแรงที่สำคัญในการศึกษาฟิสิกส์ต่อไปโดยเฉพาะ และมีความสำคัญในการใช้ในชีวิตประจำวันและในอาชีพที่เกี่ยวข้องกับวิทยาศาสตร์และเทคโนโลยีต่างๆ ด้วย การใช้ความเข้าใจในเรื่องนี้ เช่น การเดินทาง การออกกำลังกาย การออกแบบโครงสร้าง หรือการทำงานในสายงานที่เกี่ยวข้องกับวิทยาศาสตร์และเทคโนโลยี เป็นต้น โดยการศึกษาเนื้อหานี้อาจจะประกอบด้วยการทด\n\n',
                  style: TextStyle(
                    fontSize: 15,
                    fontWeight: FontWeight.bold,
                  ),
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}
