import 'package:flutter/material.dart';

void main() {
  runApp(MyApp());
}

class MyApp extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return MaterialApp(
      title: 'วิทยาศาสตร์บทที่3 มัธยมปลาย',
      theme: ThemeData(
        primarySwatch: Colors.blue,
        visualDensity: VisualDensity.adaptivePlatformDensity,
      ),
      home: Sci03(),
    );
  }
}

class Sci03 extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('วิทยาศาสตร์ บทที่3 มัธยมปลาย'),
      ),
      body: SingleChildScrollView(
        child: Center(
          child: Padding(
            padding: const EdgeInsets.all(20.0),
            child: Column(
              crossAxisAlignment: CrossAxisAlignment.start,
              children: [
                Text(
                  'เรื่อง "เซลล์ของสิ่งมีชีวิต" เป็นส่วนสำคัญของเนื้อหาในวิชาชีววิทยาในระดับมัธยมศึกษาขั้นมัธยมปีที่ 4 เนื้อหานี้มุ่งเน้นการศึกษาโครงสร้างและฟังก์ชันของเซลล์ ที่เป็นหน่วยสำคัญของสิ่งมีชีวิตทุกชนิด เรามาอธิบายเกี่ยวกับเซลล์ของสิ่งมีชีวิตต่อไปครับ:\n\n'
                  '1. โครงสร้างของเซลล์: เซลล์ประกอบด้วยส่วนประกอบหลัก ๆ สองส่วน คือ เซลล์เนื้อเยื่อ (พลาสมา) และเซลล์อินทรีย์ (โปรคารีโอติก)\n\n'
                  '   1.1 เซลล์เนื้อเยื่อ (พลาสมา): เป็นส่วนที่ประกอบด้วยส่วนสำคัญของเซลล์ เช่น สารของเนื้อเยื่อที่เป็นส่วนประกอบของเมทริกซ์ หรือระบบอุปกรณ์ที่ทำหน้าที่ในเซลล์\n\n'
                  '   1.2 เซลล์อินทรีย์ (โปรคารีโอติก): เป็นส่วนที่ประกอบด้วยส่วนที่อยู่ในเซลล์ อาทิ เอนไซม์ อาร์กิเนล วางประจุ และสารต่าง ๆ ที่มีหน้าที่ในการจัดการและควบคุมการทำงานของเซลล์\n\n'
                  '2. ฟังก์ชันของเซลล์: เซลล์มีหน้าที่สำคัญมากในการรักษาชีวิตและประมวลผลของสิ่งมีชีวิต สามารถสร้างพลังงาน แบ่งเซลล์ และประมวลผลสารต่าง ๆ ในร่างกาย\n\n'
                  '   2.1 การสร้างพลังงาน: เซลล์มีโครงสร้างภายในที่ช่วยในการสร้างพลังงาน โดยผ่านกระบวนการเรียกว่า การหายใจและการสร้างอะเอ๋อไซต์\n\n'
                  '   2.2 การแบ่งเซลล์: เซลล์มีความสามารถในการแบ่งตัวเพื่อเพิ่มจำนวนของเซลล์ ซึ่งเป็นกระบวนการสำคัญในการเจริญเติบโตและฟื้นฟูร่างกาย\n\n'
                  '   2.3การประมวลผลสาร: เซลล์มีฟังก์ชันในการประมวลผลสารต่าง ๆ ที่เข้าสู่และออกจากร่างกาย ซึ่งเป็นกระบวนการที่สำคัญในการรักษาสมดุลของสารในร่างกาย \n\n'
                  '3. ประเภทของเซลล์: มีหลายประเภทของเซลล์ที่มีฟังก์ชันและลักษณะที่แตกต่างกัน ตัวอย่างเช่น เซลล์ประสาทที่มีฟังก์ชันในการสื่อสาร และเซลล์กล้ามเนื้อที่มีฟังก์ชันในการเคลื่อนไหว\n\n'
                  '4. การสร้างเซลล์ใหม่: เซลล์มีกระบวนการสร้างเซลล์ใหม่ที่เรียกว่าการแบ่งเซลล์ โดยที่เซลล์แม่จะแบ่งตัวเป็นสองเซลล์ลูก ทำให้จำนวนเซลล์เพิ่มขึ้นและช่วยในการเจริญเติบโตของสิ่งมีชีวิต\n\n'
                  'การเรียนรู้เกี่ยวกับเซลล์ของสิ่งมีชีวิตเป็นสิ่งสำคัญในการเข้าใจกระบวนการทางชีวภาพและการศึกษาเกี่ยวกับสิ่งมีชีวิตทั้งหมด เป็นพื้นฐานสำคัญที่จะเข้าใจในระดับมัธยมศึกษาครับ\n\n',
                  style: TextStyle(
                    fontSize: 15,
                    fontWeight: FontWeight.bold,
                  ),
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}
