import 'package:flutter/material.dart';

void main() {
  runApp(MyApp());
}

class MyApp extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return MaterialApp(
      title: 'สังคมศึกษาบทที่3 มัธยมปลาย',
      theme: ThemeData(
        primarySwatch: Colors.blue,
        visualDensity: VisualDensity.adaptivePlatformDensity,
      ),
      home: Social03(),
    );
  }
}

class Social03 extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('สังคมศึกษา บทที่3 มัธยมปลาย'),
      ),
      body: SingleChildScrollView(
        child: Center(
          child: Padding(
            padding: const EdgeInsets.all(20.0),
            child: Column(
              crossAxisAlignment: CrossAxisAlignment.start,
              children: [
                Text(
                  'โลกในศตวรรษที่ 21\n\n'
                  'โลกในศตวรรษที่ 21 เปลี่ยนโฉมหน้าของโลกจากยุคศตวรรษที่ 20 ไปอย่างสมบูรณ์ ปัจจุบันโลกเต็มไปด้วยปัญหาต่างๆ มากมาย ซึ่งแต่ละปัญหาก็มีความซับซ้อนมากกว่าในอดีตที่ผ่านมามาก เนื่องจากความก้าวหน้าทางเทคโนโลยี โดยเฉพาะเทคโนโลยีดิจิทัล ที่ทำให้โลกไร้พรมแดน หรือทำให้โลกแคบลง ทุกประเทศมีโอกาสเป็นผู้เล่นหน้าใหม่ การช่วงชิงอำนาจระหว่างรัฐมหาอำนาจ ไม่อาจใช้กำลังทหารแย่งชิงเอาได้เหมือนในสมัยก่อน ตัวอย่างของปัญหาต่างๆ ที่โลกกำลังเผชิญอยู่ในปัจจุบันได้แก่ ปัญหาการก่อการร้าย ปัญหาเศรษฐกิจ ปัญหาสังคม เป็นต้น\n\n'
                  '1. ปัญหาการก่อการร้าย\n\n'
                  'เรื่องการก่อการร้ายได้รับความสนใจจากประชาคมโลกอย่างจริงจัง เนื่องด้วยความรุนแรง และผลกระทบที่มีอย่างมากมายมหาศาล ต่อการดำรงชีวิตอยู่ของประชาคมโลก ในขณะที่ความขัดแย้งทางการเมืองในศตวรรษที่ 21 ก็มีความรุนแรงมากขึ้น อันเนื่องจากการสะสมอาวุธที่มีความร้ายแรง เช่น อาวุธนิวเคลียร์ รวมถึงการประสานความแตกแยกทางความคิดที่ยากเย็นยิ่งขึ้น เนื่องด้วยมีความซับซ้อนของปัญหาแตกต่างไปจากการทำสงครามในยุคที่ผ่านมา\n\n'
                  '2. ปัญหาเศรษฐกิจ\n\n'
                  'ในขณะที่ประเด็นเรื่องเศรษฐกิจในศตวรรษที่ 21 ถือว่าเป็นสิ่งที่มีความสำคัญเป็นอย่างยิ่งต่อประชาคมโลกในยุคสมัยนี้ ประชาคมโลกล้วนพึ่งพิงอยู่ด้วยการเคลื่อนไหวอย่างเป็นพลวัตในทางเศรษฐกิจ แตกต่างไปจากโลกในยุคสมัยเก่า ซึ่งมีลักษณะของเศรษฐกิจในรูปแบบของการพึ่งพาตัวเอง\n\n'
                  'ในแง่นี้ ด้วยปัจจัยและเงื่อนไขต่างๆ ทางเศรษฐกิจ จึงต้องดำเนินไปพร้อมกันอย่างเป็นรูปแบบปัจจัย ทำให้เมื่อปัจจัยตัวใดตัวหนึ่งเกิดปัญหาขึ้น ระบบเศรษฐกิจของโลกก็จะมีปัญหาขึ้นทันที ตัวอย่างเช่น การแพร่ระบาดของไวรัสโควิด-19 ที่ไม่อาจจะสามารถควบคุมได้ ส่งผลโดยภาพรวมให้กับเศรษฐกิจทั้งโลกเกิดสภาวะชะงักงัน อย่างที่ไม่เคยปรากฏขึ้นมาก่อน สถานการณ์ดังกล่าวนี้ เป็นสิ่งที่ชี้ให้เห็นว่าระบบเศรษฐกิจในโลกยุคศตวรรษที่ 21 มีลักษณะของความสัมพันธ์เชื่อมโยงอย่างซับซ้อน มากกว่าเศรษฐกิจโลกในยุคอดีตที่ผ่านมา\n\n'
                  '3. ปัญหาสังคม\n\n'
                  'ในขณะที่การเปลี่ยนแปลงทางสังคม และการดำรงชีวิตของมนุษย์ในยุคศตวรรษที่ 21 ก็มีความเปลี่ยนแปลงไปจากรูปแบบการดำรงชีวิตในลักษณะเดิมมาก เนื่องด้วยความเจริญก้าวหน้า และวิวัฒนาการที่ดีขึ้นของเทคโนโลยี ทำให้การดำรงชีวิตต้องพึ่งพิงเทคโนโลยีอย่างมาก ซึ่งกลายเป็นปัจจัยพื้นฐานที่สำคัญของชีวิตมนุษย์ในยุคปัจจุบัน\n\n'
                  'แต่อย่างไรก็ตาม ภายใต้เงื่อนไขดังกล่าวนี้ มนุษย์กลับต้องเผชิญหน้ากับปัญหาเรื่องความปลอดภัย และความเป็นส่วนตัว ซึ่งอาจจะสามารถรั่วไหล หรือถูกตรวจสอบได้ง่าย ภายใต้การเข้าถึงเทคโนโลยีที่ทันสมัยดังกล่าวในสถานการณ์เช่นนี้ ความปลอดภัยในการดำรงชีวิตอยู่ของมนุษย์ จึงมีความหมายที่เปลี่ยนแปลงไปจากความปลอดภัยของชีวิตในยุคอดีตที่ผ่านมา\n\n'
                  'หากพิจารณาด้วยเงื่อนไขที่กล่าวมานั้น จะพบได้ว่า โลกในยุคศตวรรษที่ 21 อาจจะถือได้ว่าเป็นโลกในยุคแห่งการเปลี่ยนแปลงโดยแท้จริง ซึ่งถึงแม้จะมีรากฐานการพัฒนามาจากโลกในยุคอดีต หากแต่ในโลกยุคสมัยดังกล่าวนี้ กลับกลายเป็นโลกซึ่งถูกพัฒนาขึ้นโดยมีความแตกต่างอย่างมีนัยยะที่สำคัญจากพัฒนาการของโลกในอดีตที่ผ่านมา ดังนั้น มนุษย์ซึ่งดำรงชีวิตอยู่ในโลกยุคศตวรรษที่ 21 จึงต้องสามารถปรับตัว เพื่อจะดำรงชีวิตอยู่ให้รอดท่ามกลางการเปลี่ยนแปลงที่รวดเร็ว และทำนายได้ยาก\n\n',
                  style: TextStyle(
                    fontSize: 15,
                    fontWeight: FontWeight.bold,
                  ),
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}
