import 'package:flutter/material.dart';

void main() {
  runApp(MyApp());
}

class MyApp extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return MaterialApp(
      title: 'ภาษาไทยบทที่3 มัธยมปลาย',
      theme: ThemeData(
        primarySwatch: Colors.blue,
        visualDensity: VisualDensity.adaptivePlatformDensity,
      ),
      home: Thai03(),
    );
  }
}

class Thai03 extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('ภาษาไทย บทที่3 มัธยมปลาย'),
      ),
      body: SingleChildScrollView(
        child: Center(
          child: Padding(
            padding: const EdgeInsets.all(20.0),
            child: Column(
              crossAxisAlignment: CrossAxisAlignment.start,
              children: [
                Text(
                  'การสื่อสารด้วยภาษาไทย\n\n'
                  '๑. การออกเสียงคำ\n\n'
                  '   ๑.๑ การออกเสียงพยัญชนะ เสียงพยัญชนะที่มีปัญหาในการออกเสียงแบ่งออกเป็น ๒ ประเภท คือ\n\n'
                  '       ๑) พยัญชนะเดี่ยว เมื่อใช้เป็นพยัญชนะต้น จะมีบางเสียงที่มีปัญหาในการออกเสียง เช่นเสียง /ช/ เสียง /ซ/ เสียง /ร/ เสียง /ล/\n\n'
                  '       ๒) พยัญชนะควบกล้ำ เป็นพยัญชนะ ๒ ตัวที่ออกเสียงควบกัน โดยนำ ร ล ว มาเป็นอักษรควบ มักเกิดปัญหาเมื่อนำมาใช้เป็นพยัญชนะต้น เพราะออกเสียงเสียงพยัญชนะต้นเพียงเสียงเดียว ไม่ออกเสียงพยัญชนะควบกล้ำ\n\n'
                  '   ๑.๒ การออกเสียงสระ\n\n'
                  '       ๑) การออกเสียงสระเสียงยาวเป็นสระเสียงสั้นเมื่อเป็นคำที่ไม่เน้น\n\n'
                  '       ๒) การออกเสียงสระเสียงยาว ถึงแม้เป็นสระเสียงสั้น เมื่อเป็นคำที่ทำหน้าที่สำคัญในประโยค\n\n'
                  '   ๑.๓ การออกเสียงวรรณยุกต์  เสียงวรรณยุกต์ของไทยทั้ง ๕ เสียง สามารถจัดเป็น ๒ กลุ่มใหญ่ ๆ คือ\n\n'
                  '       ๑) วรรณยุกต์ระดับ จะมีระดับเสียงคงที่ตลอดพยางค์\n\n'
                  '       ๒) วรรณยุกต์เปลี่ยนระดับ ขณะเปล่งเสียงจากต้นพยางค์สู่ท้ายพยางค์ระดับเสียงจะมีการเปลี่ยนแปลง\n\n'
                  '๒. การลงเสียงหนักเบา\n\n'
                  '       ๑) คำสองพยางค์ นอกจากคำซ้อนที่มักจะลงเสียงหนักทั้งสองพยางค์แล้ว คำชนิดอื่นมักจะลงเสียงหนักที่พยางค์หลัง ไม่ว่าจะมีส่วนประกอบของพยางค์เป็นอย่างไรก็ตาม\n\n'
                  '       ๒) คำสามพยางค์ สามารถลงเสียงหนักเบาได้ ๔ รูปแบบ คือ\n\n'
                  '           - ลงเสียงหนักเฉพาะพยางค์ที่ ๓\n\n'
                  '           - ลงเสียงหนักเฉพาะพยางค์ที่ ๒ และ ๓\n\n'
                  '           - ลงเสียงหนักเฉพาะพยางค์ที่ ๑ และ ๓\n\n'
                  '           - ลงเสียงหนักเฉพาะพยางค์ที่ ๓ หรือ ลงเสียงหนักเฉพาะพยางค์ที่ ๑ และ ๓ ก็ได้\n\n'
                  '       ๓) คำสี่พยางค์ สามารถลงเสียงหนักเบาได้ ๖ รูปแบบ คือ\n\n'
                  '           - ลงเสียงหนักเฉพาะพยางค์ที่ ๔\n\n'
                  '           - ลงเสียงหนักเฉพาะพยางค์ที่ ๒ และ ๔\n\n'
                  '           - ลงเสียงหนักเฉพาะพยางค์ที่ ๑ และ ๔\n\n'
                  '           - ลงเสียงหนักเฉพาะพยางค์ที่ ๓ และ ๔\n\n'
                  '           - ลงเสียงหนักเฉพาะพยางค์ที่ ๑ ๒ และ ๔\n\n'
                  '           - ลงเสียงหนักเฉพาะพยางค์ที่ ๑ ๓ และ ๔\n\n'
                  '       ยกเว้นคำบางคำ เช่น อคติ จะลงเสียงหนักพยางค์ที่ ๑ และ คณบดี จะลงเสียงหนักพยางค์ที่ ๒\n\n'
                  '       ๔) คำหลายพยางค์ มักลงเสียงหนักที่พยางค์สุดท้าย\n\n'
                  '       ๕) คำที่ทำหน้าที่หลักของประโยค มักจะลงเสียงหนัก ได้แก่ คำนาม คำกริยา หรือคำเน้น ส่วนคำสรรพนาม และคำเชื่อม มักจะไม่ลงเสียงหนัก\n\n'
                  '       ๖) ลงเสียงหนักตรงคำที่ต้องการแสดงเจตนาเป็นพิเศษ การลงเสียงหนักเบาไม่มีนัยสำคัญต่อความหมายในระดับคำ แต่จะมีนัยสำคัญต่อความหมายของประโยคหรือข้อความทั้งหมด\n\n'
                  '๓. การออกเสียงคำที่มาจากภาษาบาลีและสันสกฤต\n\n'
                  '   ๓.๑ การออกเสียงสระแต่ละพยางค์\n\n'
                  '       ๑) คำเรียงพยางค์ในภาษาเดิม ออกเสียงพยัญชนะตัวสุดท้ายเป็นตัวสะกด\n\n'
                  '       ๒) คำเรียงพยางค์ที่มีตัว ร ตามพยัญชนะต้น หรือตัว ร เป็นพยัญชนะสุดท้าย หากตัว ร ไม่มีรูปสระกำกับ พยัญชนะด้านหน้าจะออกเสียงสระออ\n\n'
                  '       ๓) คำที่พยัญชนะต้นเป็น บ สามารถออกเสียงสระออ โดยไม่มีตัว ร อยู่ด้านหลังก็ได้\n\n'
                  '   ๓.๒ การออกเสียงสระอะท้ายตัวสะกด\n\n'
                  '       ๑) คำที่มีตัวสะกดเป็นพยัญชนะวรรค มักจะไม่ออกเสียงสระอะ เมื่อมีตัวตามตัวสะกดเป็นพยัญชนะวรรคหรือ ศ ษ ส\n\n'
                  '       ๒) คำที่สะกดด้วยพยัญชนะท้ายวรรค หรือพยัญชนะนาสิก ได้แก่ ง ญ ณ น มและมี ย ร ล ว เป็นตัวตาม จะไม่ออกเสียงสระอะ\n\n'
                  '       ๓) คำที่สะกดด้วยพยัญชนะวรรค และมี ย ร ล ว เป็นตัวตาม มักจะออกเสียงสระอะ ไม่เต็มมาตรา\n\n'
                  '       ๔) คำที่มี ย ร ล ว ศ ษ ส เป็นตัวสะกดและมีพยัญชนะตัวอื่นเป็นตัวตาม มักจะออกเสียงสระอะ ไม่เต็มมาตรา\n\n'
                  '       ๕) คำที่มีตัวสะกดและตัวตามตัวสะกดเป็นพยัญชนะเศษวรรค และเป็นอักษรซ้ำไม่ออกเสียงสระอะ\n\n'
                  '   ๓.๓ การออกเสียงพยางค์ท้ายคำ\n\n'
                  '       ๑) คำเดิมเป็นคำเรียงพยางค์ตั้งแต่สองพยางค์ขึ้นไป พยางค์ท้ายประสมด้วยสระอิหรือสระอุ เมื่อนำมาใช้ในภาษาไทย เสียงพยัญชนะต้นของพยางค์ท้ายจะกลายมาเป็นเสียงตัวสะกดของพยางค์หน้า และไม่ออกเสียงสระที่กำกับอยู่\n\n'
                  '       ๒) คำเดิมไม่ใช่คำพยางค์เรียง ที่พยางค์ต้นมี ฏ ฑ ต เป็นตัวสะกด ส่วนพยางค์หลังประสมด้วยสระอิ เมื่อนำมาใช้ในภาษาไทย เสียงพยัญชนะต้นของพยางค์ท้ายจะกลายมาเป็นเสียงตัวสะกดของพยางค์หน้า และออกเสียงสระอิที่กำกับอยู่\n\n'
                  '   ๓.๔ การออกเสียงคำสมาส โดยเป็นคำภาษาบาลีและสันสกฤตตั้งแต่สองคำขึ้นไปที่นำมารวมกัน แล้วเกิดเป็นคำใหม่ที่มีความหมายเกี่ยวข้องกับคำเดิม มีหลักการออกเสียงดังนี้\n\n'
                  '       ๑) คำสมาสส่วนมากออกเสียงสระที่พยางค์ท้ายของคำหน้าเพื่อให้ต่อเนื่องกับคำหลัง หากว่าไม่มีรูปสระให้ออกเสียงสระอะ\n\n'
                  '       ๒) คำสมาสบางคำไม่ออกเสียงสระที่พยางค์ท้ายของคำหน้า\n\n'
                  '       ๓) คำสมาสบางคำออกเสียงพยางค์ท้ายของคำหน้าแบบเรียงพยางค์หรือเป็นตัวสะกดก็ได้\n\n'
                  '       ๔) คำสมาสบางคำออกเสียงพยางค์ท้ายของคำหน้าแบบเรียงพยางค์ บางคำออกเสียงแบบเป็นตัวสะกด เช่นโลกวิทู ออกเสียง โล-กะ-วิ-ทู โลกธรรม ออกเสียง โลก-กะ-ทำ\n\n'
                  '       ๕) คำสมาสบางคำออกเสียงสระที่พยางค์ท้ายของคำหน้าหรือไม่ออกก็ได้\n\n'
                  '       ๖) คำบางคำไม่ใช่คำสมาส แต่ออกเสียงสระที่พยางค์ท้ายของคำหน้าอย่างคำสมาส\n\n'
                  '   ๓.๕ การออกเสียงคำอย่างอักษรนำ\n\n'
                  '       ๑) คำบาลีสันสกฤตเดิมเป็นคำเรียงพยางค์ เมื่อนำมาใช้ในภาษาไทย บางครั้งออกเสียงอย่างอักษรนำ บางครั้งไม่ออกเสียงอย่างอักษรนำ\n\n'
                  '       ๒) คำบาลีสันสกฤตเดิมเป็นคำเรียงพยางค์ เมื่อนำมาใช้ในภาษาไทยก็ออกเสียงอย่างอักษรนำ\n\n'
                  '       ๓) คำบาลีสันสกฤตซึ่งไม่มีรูปคำหรืออักษรนำ แต่เมื่อนำมาใช้ในภาษาไทยก็ออกเสียงอย่างอักษรนำ\n\n'
                  '       ๔) คำบาลีสันสกฤตบางคำนำมาใช้ในภาษาไทยออกเสียงเรียงพยางค์แต่มักออกเสียงผิดเป็นอักษรนำ\n\n'
                  '๔. การออกเสียงคำแผลง\n\n'
                  'เมื่อแผลงคำแล้วจะเกิดเป็นพยางค์ใหม่ หากคำเดิมเป็นอักษรควบหรืออักษรนำพยางค์หลังของคำใหม่ที่ได้จะออกเสียงวรรณยุกต์ตามคำเดิม\n\n'
                  'ถ้าคำเดิมไม่ใช่อักษรควบหรืออักษรนำ เมื่อแผลงแล้วพยางค์หลังของคำใหม่จะไม่ออกเสียงวรรณยุกต์ตามคำเดิม\n\n'
                  '๕. การสะกดคำ\n\n'
                  '   ๕.๑ การใช้พยัญชนะ\n\n'
                  '       ๑) การแบ่งพยัญชนะ แบ่งตามรูปพยัญชนะได้ ๓ พวก คือ\n\n'
                  '           (๑) พยัญชนะกลาง ใช้ได้กับคำที่มาจากทุกภาษา มี ๒๑ รูป คือ ก ข ค ง จ ฉ ช ต ถ ท น ป ผ พ ม ย ร ล ว ส ห\n\n'
                  '           (๒) พยัญชนะเดิม ใช้ได้กับคำไทยแท้บางคำ และคำภาษาบาลีสันสกฤต มี ๑๓ รูป คือ ฆ ฌ ญ ฏ ฐ ฑ ฒ ณ ธ ภ ศ ษ ฬ\n\n'
                  '           (๓) พยัญชนะเติม ส่วนมากใช้กับคำไทยแท้ สามารถใช้กับคำภาษาบาลีสันสกฤตบางคำ และใช้ได้กับคำภาษาอื่น ๆ มี ๑๐ รูป คือ ฃ ฅ ซ ฎ ด บ ฝ ฟ อ ฮ\n\n'
                  '   ๕.๒ ประโยชน์จากการแบ่งพยัญชนะ สามารถนำมาใช้ในการสะกดคำได้\n\n',
                  style: TextStyle(
                    fontSize: 15,
                    fontWeight: FontWeight.bold,
                  ),
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}
